emacs/lisp/theme.org
#+TITLE: Personal GNU Emacs Config
#+AUTHOR: Vinci Xu & Kate Ma
#+DESCRIPTION: Vinci & Kate's theme config
#+OPTIONS: toc:4

* TABLE OF CONTENTS :toc_4:
- [[#graphic-and-theme][GRAPHIC AND THEME]]
  - [[#fonts][Fonts]]
  - [[#theme][Theme]]
    - [[#rose-pine][Rose Pine]]

* GRAPHIC AND THEME

** Fonts
设置自己喜欢的字体

#+begin_src emacs-lisp
  (set-face-attribute 'default nil
      :font "Cascadia Code"
      :height 130
      :weight 'regular)
  (set-face-attribute 'variable-pitch nil
      :font "Symbols Nerd Font"
      :height 130
      :weight 'medium)
  (set-face-attribute 'fixed-pitch nil
      :font "FiraCode Nerd Font"
      :height 130
      :weight 'regular)

  (set-face-attribute 'font-lock-keyword-face nil
      :slant 'italic)
  (set-face-attribute 'font-lock-comment-face nil
      :slant 'italic)

  (add-to-list 'default-frame-alist '(font . "Cascadia Code-13"))

  ;; 中文字体修正
  (set-fontset-font t '(#x4e00 . #x9fff) (font-spec :family "Source Han Sans CN" :size 12) nil 'prepend)
#+end_src

** Theme

*** Rose Pine
个人最喜欢的 theme

#+begin_src emacs-lisp
(use-package autothemer
   :ensure t
   :elpaca (:host github
             :repo "jasonm23/autothemer"))
(add-to-list 'custom-theme-load-path "~/.config/emacs/theme/")
(load-theme 'rose-pine t)
#+end_src
